var classlayer = {

}

var ruleset = {
	"numbers": [ // seperate them based on waw if taa isn't there or alif maqsora say if ين instead of ون الجملة مرفوعة والمعطوف على مرفوع مرفوع
	// if

	],
	"metathesis-harkat": [
		// wrong, valid
		[/[و]{1}/, /ُ$/, "كتابة الضمة واو"],
		[/[ا]{1}/, /َ$/, "كتابة الفتحة ألفا", {execlude:"word", regex:[/هذا|هذه|رحمن|لكن/] }],
		[/[ي]{1}/, /َ$/, "كتابة الكسرة ياءً"],

		[/[ون|ن]{1}/, /ٌ$/, "مشكل في كتابة تنوين الضم"],
		[/[ين|ن]{1}/, /ٍ$/, "مشكل في كتابة تنوين الكسر"],
		[/[ان|ن]{1}/, /اً$/, "مشكل في كتابة تنوين الفتح"],
		[/تي$/, /تِ$/, "كتابة التاء", {"POS":"verb", "msg": "الفعل المصرف مع"}],
	],

	"metathesis": [ // it can be either reciproque or an issue from a sound to another
		// wrong, valid
		[/[ى]{1}/, /[ي]{1}/, "تمييز الياء عن الألف المقصورة",
			{exclude: {'country': 'EG', 'comment':"ترسم الياء في المدرسة المصرية غير منقوطة"}}
		],
		[/[ي]{1}/, /[ى]{1}/, "تكتب الياء منقوطة في الإملاء المعاصر"],
		[/[س]{1}/, /[ص]{1}/, "تمييز السين عن الصاد"],
		[/[ص]{1}/, /[س]{1}/, "تمييز الصاد عن السين"],
		[/[سش]{1}/, /[سش]{1}/, "تمييز السين عن الشين"],
		[/[اويأءؤئ]{1}/, /[أءؤئ]{1}/, "مشكل في كتابة الهمزات"],
		[/[ه]{1}/, /[ة]{1}/, "مشكل في كتابة التاء المربوطة"],
		[/[ة]{1}/, /[ت]{1}/, "مشكل في كتابة التاء المفتوحة"],
		[/[ضظ]{1}/, /[ضظ]{1}/, "مشكل في التفريق بين الضاد والظاء"],
		[/[ز]{1}/, /[ذ]{1}/, "مشكل في التفريق بين الذال والزاي"],
		[/[ذ]{1}/, /[ز]{1}/, "مشكل في التفريق بين الذال والزاي"],
		[/[ز]{1}/, /[ظ]{1}/, "مشكل في التفريق بين الظاء والزاي أو الصاد المشممة"],
		[/[د]{1}/, /[ذ]{1}/, "مشكل في التفريق بين الذال والدال"],
		[/[ذد]{1}/, /[ذد]{1}/, "مشكل في التفريق بين الذال والدال"],
		[/[ت]{1}/, /[ث]{1}/, "مشكل في التفريق بين الذال والزاي"],
		[/[ط]{1}/, /[ظ]{1}/, "مشكل في التفريق بين الظاء والطاء"],
		[/[ه]{1}/, /[ح]{1}/, "مشكل في تمييز بين الحاء من الهاء"],
		[/[ق]{1}/, /[ج]{1}/, "مشكل في تمييز القاف والجيم الفصيحة"],
		[/[ءأاؤئ]{1}/, /[ق]{1}/, "تمييز صوت القاف من الهمزة"],
		[/[س]{1}/, /[ث]{1}/, "مشكل في التفريق بين الثاء والسين"],
		[/[كق]{1}/, /[قك]{1}/, "تمييز القاف من الكاف"],
		[/[وءأاؤئي]{1}/, /[ع]{1}/, "مشكل في تمييز صوت العين"],
		[/[ن]{1}/, /[ا]{1}/, "مشكل في تنوين الفتح"], // not accurate
		[/[ن]{/, /[ا]{1}/, "مشكل في تنوين الفتح"],
		[/^ا/, /@أ/, "مشكل في كتابة همزة القطع"],
		[/[ا]{1}/, /[ى]{1}/, "تمييز الياء عن الألف المقصورة", {cases: {POS:["verb", "3. person", "male", "singular"], comment: {"ar": "يكتب فعل %Infinitive بالألف المقصورة، لأن مضارعه %Imperfect بالواو, والقاعدة أن الفعل إذا كان مضارعه واو كتب ألفا ممدودة في الماضي مثل دعا يدعو وبدا يبدو أما إذا كانت ياء كُتبت ألفا مقصورة مثل سقى يسقي وجرى يجري"}}}]
	],
	"separated": [
		[/^و$/, "يجب وصل الواو بما يليها دون ترك فراغ"],
		[/^ال$/, "يجب وصل الألف واللام بما يليها"],
	],

	// if last letter yaa and word is verb past
	// ["past-verb" => "message"]
	"word-pattern": [ //common misspelling for specific words or patterns
		// valid then wrong
		[/هذا/, /هاذا/, "تُحذف الألف رسما في هذه الكلمة" ],
		[/بسم$/, /باسم/,"إذا تُبعت باسم الجلالة <b>الله</b>، سقطت ألف <b>اسم</b> جريا على عادة العرب في تخفيف كتابتها"], //ambigouis needs harakat
		[/هذه$/, /هاذه/, "تُحذف الألف رسما في هذه الكلمة"  ],
		[/هكذا/, /هاكذا/, "تُحذف الألف رسما في هذه الكلمة"  ],
		[/ذلك/, /ذالك/, "تُحذف الألف رسما في هذه الكلمة"  ],
		[/ولئك/, /ولائك/, "تُحذف الألف رسما في هذه الكلمة" ],
		[/رحمن/, /رحمان/, "تُحذف الألف رسما في هذه الكلمة" ],
		[/إله/, /لاه/, "تُحذف الألف رسما في هذه الكلمة" ],
		[/لكن/, /لاكن/, "تُحذف الألف رسما في هذه الكلمة" ],
		[/مائة|مئة/, /مائة|مئة/, "يصح أن تكتب مِئْةَ جريا على قواعد الإملاء أو مائة وهي كتابة تاريخية ترجع إلى ما قبل زمن تعجيم وتنقيط الحروف، فكانت تُضاف الألف لتمييزها عن كلمات مثل منه " ],
		[/^إذن|إذا$/, /^إذا|إذن$/, "يصح أن تكتب إذن أو إذًا لكن المختار لدفع التوهم كتابتها بالنون" ],
	],
	"lemma-pattern": [
		//wrong, valid
		[/إسم/, /^اسم$/, "من الأسماء العشرة لا تُكتب فيها همزة القطع ولا تنطق عند الوصل. مثال: ننطق (ما اسمك؟) هكذا (مسمك)." ],
		[/إبن/, /^ابن$/, "من الأسماء العشرة، لا تُكتب فيها همزة القطع ولا تنطق عند وصلها بكلمة قبلها." ],
		[/إثنان/, /^اثنان|اثنين$/, "من الأسماء العشرة، لا تُكتب فيها همزة القطع ولا تنطق عند وصلها بكلمة قبلها." ], //Lemma API may change so we take both cases
		[/إثنتان/, /^اثنتان|اثنين$/, "من الأسماء العشرة، لا تُكتب فيها همزة القطع ولا تنطق عند وصلها بكلمة قبلها." ],
		[/إمرؤ|امرئ/, /^امرؤ|امرئ$/, "من الأسماء العشرة، لا تُكتب فيها همزة القطع ولا تنطق عند وصلها بكلمة قبلها." ],
		[/إمرأة/, /^امرأة$/, "من الأسماء العشرة، لا تُكتب فيها همزة القطع ولا تنطق عند وصلها بكلمة قبلها." ],

		//من الممكن إضافة ملاحظات في تفصيح الكلمات أو إيضاح اختلاف المعنى والضبط
		[/نص$/, /^نصف$/, "نص عامية والفصيح نِصْف" ],
	],
	"text-pattern":[
		"", //analyzes in the whole text if commas are actually followed by a space
	],
	// case of missing space after ,
	"punctuation": {
		'string': "",
		'regex': /[.،:؟؛!,;?]/g,
		'symboles': ['.', '،', ':', '؟', '؛', '!'],
		'names': ['النقطة', 'الفاصلة', 'النقطتين', 'علامة الاستفهام', 'الفاصلة المنقوطة', 'علامة التعجب'],
		'notes' : {
				'.' : 'تُستخدمُ النقطة (.) في نهاية الفقرة أو الجمل التامة.',
				'،' : 'تُستخدم الفاصلة (،) بين الجمل المتصلة المعنى.',
				':' : 'تُستخدم النقطتان (:) بعد القول مثل قال زيدٌ: أنا هنا. وتُستخدم أيضا لتفصيل الأقسام أو التعريف مثل فصول السنة أربعة: صيف وشتاء وربيع وخريف.',
				'؟' : 'تُستخدم علامة الاستفهام (؟) بعد صيغة سؤال مسبوقة بأداة استفهام، مثل: ما مهنتك؟',
				'؛' : 'تُستخدم الفاصلة المنقوطة (؛) بين جملتين إحداهما سبب حدوث الأخرى مثل أستيقظا باكرًا؛ لأذهب للمدرسة.',
				'!' : 'تُستخدمُ علامة التعجب والتأثر والانفعال (!) بعد جملة التعجب، أو ما دل على الفرح، والحزن، والاستغاثة، والدعاء، مثل: ما أجمل الربيع!، واحسرتاه!',
				',' : "تكتب الفاصلة العربية على النحو التالي: (،)",
				';' : "تكتب الفاصلة المنقوطة بالعربية على النحو التالي: (؛)",
				'?' : "تكتب علامة الاستفهام العربية على النحو التالي: (؟)",
		}
	},
};

// Sample
var georule = {

	"MA-CA" : ["ثت", "ذد"],
	"DZ-ALG" : ["ذد", "ظض"],
	"EG-EG" : ["قج", "ذز", "ثس"],
	"KSA" : ["ضظ"],
	"PAK" : ["ذز"],

};
